Revit 2027 API
PlasticVinyl.PlasticvinylType Property
 The property labeled "Type" from the "PlasticVinyl" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string PlasticvinylType { get; }
Public Shared ReadOnly Property PlasticvinylType As String
	Get
public:
static property String^ PlasticvinylType {
	String^ get ();
}
static member PlasticvinylType : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "PlasticvinylType".
See Also
Reference
PlasticVinyl Class
Autodesk.Revit.DB.Visual Namespace